ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
<module name="PRU_ICSSG0_PR1_CFG_SLV" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_CFG__SLV__REGS_pid_reg" acronym="PR1_CFG__SLV__REGS_pid_reg" offset="0x0" width="32" description="">
		<bitfield id="ICSS_IDVER" width="32" begin="31" end="0" resetval="0x1795162371" description="Module ID field" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_hwdis_reg" acronym="PR1_CFG__SLV__REGS_hwdis_reg" offset="0x4" width="32" description="">
		<bitfield id="HWDIS" width="8" begin="7" end="0" resetval="0x0" description="HW Disable Observation" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_gpcfg0_reg" acronym="PR1_CFG__SLV__REGS_gpcfg0_reg" offset="0x8" width="32" description="">
		<bitfield id="PR1_PRU0_GP_MUX_SEL" width="4" begin="29" end="26" resetval="0x0" description="" range="29 - 26" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_SH1_SEL" width="1" begin="25" end="25" resetval="0x0" description="" range="25" rwaccess="R"/> 
		<bitfield id="PRU0_GPO_DIV1" width="5" begin="24" end="20" resetval="0x0" description="" range="24 - 20" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_DIV0" width="5" begin="19" end="15" resetval="0x0" description="" range="19 - 15" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_MODE" width="1" begin="14" end="14" resetval="0x0" description="" range="14" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_SB" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="PRU0_GPI_DIV1" width="5" begin="12" end="8" resetval="0x0" description="" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_DIV0" width="5" begin="7" end="3" resetval="0x0" description="" range="7 - 3" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_CLK_MODE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_MODE" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_gpcfg1_reg" acronym="PR1_CFG__SLV__REGS_gpcfg1_reg" offset="0xC" width="32" description="">
		<bitfield id="PR1_PRU1_GP_MUX_SEL" width="4" begin="29" end="26" resetval="0x0" description="" range="29 - 26" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_SH1_SEL" width="1" begin="25" end="25" resetval="0x0" description="" range="25" rwaccess="R"/> 
		<bitfield id="PRU1_GPO_DIV1" width="5" begin="24" end="20" resetval="0x0" description="" range="24 - 20" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_DIV0" width="5" begin="19" end="15" resetval="0x0" description="" range="19 - 15" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_MODE" width="1" begin="14" end="14" resetval="0x0" description="" range="14" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_SB" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="PRU1_GPI_DIV1" width="5" begin="12" end="8" resetval="0x0" description="" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_DIV0" width="5" begin="7" end="3" resetval="0x0" description="" range="7 - 3" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_CLK_MODE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_MODE" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_cgr_reg" acronym="PR1_CFG__SLV__REGS_cgr_reg" offset="0x10" width="32" description="">
		<bitfield id="ICSS_STOP_ACK" width="1" begin="31" end="31" resetval="0x1" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="ICSS_STOP_REQ" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R"/> 
		<bitfield id="ICSS_PWR_IDLE" width="1" begin="29" end="29" resetval="0x1" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="BOTTOM_HALF_CLK_GATE_EN" width="1" begin="21" end="21" resetval="0x1" description="" range="21" rwaccess="R/W"/> 
		<bitfield id="TOP_HALF_CLK_GATE_EN" width="1" begin="20" end="20" resetval="0x1" description="" range="20" rwaccess="R/W"/> 
		<bitfield id="AUTO_SLICE1_CLK_GATE_EN" width="1" begin="19" end="19" resetval="0x0" description="" range="19" rwaccess="R/W"/> 
		<bitfield id="AUTO_SLICE0_CLK_GATE_EN" width="1" begin="18" end="18" resetval="0x0" description="" range="18" rwaccess="R/W"/> 
		<bitfield id="IEP_CLK_EN" width="1" begin="17" end="17" resetval="0x1" description="" range="17" rwaccess="R/W"/> 
		<bitfield id="IEP_CLK_STOP_ACK" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/> 
		<bitfield id="IEP_CLK_STOP_REQ" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/> 
		<bitfield id="ECAP_CLK_EN" width="1" begin="14" end="14" resetval="0x1" description="" range="14" rwaccess="R/W"/> 
		<bitfield id="ECAP_CLK_STOP_ACK" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R"/> 
		<bitfield id="ECAP_CLK_STOP_REQ" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/> 
		<bitfield id="UART_CLK_EN" width="1" begin="11" end="11" resetval="0x1" description="" range="11" rwaccess="R/W"/> 
		<bitfield id="UART_CLK_STOP_ACK" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R"/> 
		<bitfield id="UART_CLK_STOP_REQ" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="INTC_CLK_EN" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="INTC_CLK_STOP_ACK" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="INTC_CLK_STOP_REQ" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_gpecfg0_reg" acronym="PR1_CFG__SLV__REGS_gpecfg0_reg" offset="0x14" width="32" description="">
		<bitfield id="PRU0_GPO_SHIFT_CLK_DONE" width="1" begin="17" end="17" resetval="0x0" description="" range="17" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_GPO_SHIFT_CLK_HIGH" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_SHIFT_CNT" width="8" begin="15" end="8" resetval="0x0" description="" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_SHIFT_GP_EN" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_SHIFT_CLK_FREE" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPO_SHIFT_SWAP" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_SHIFT_EN" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="PRU0_GPI_SB_P" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_gpecfg1_reg" acronym="PR1_CFG__SLV__REGS_gpecfg1_reg" offset="0x18" width="32" description="">
		<bitfield id="PRU1_GPO_SHIFT_CLK_DONE" width="1" begin="17" end="17" resetval="0x0" description="" range="17" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_GPO_SHIFT_CLK_HIGH" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_SHIFT_CNT" width="8" begin="15" end="8" resetval="0x0" description="" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_SHIFT_GP_EN" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_SHIFT_CLK_FREE" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPO_SHIFT_SWAP" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_SHIFT_EN" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="PRU1_GPI_SB_P" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_reset_iso_reg" acronym="PR1_CFG__SLV__REGS_reset_iso_reg" offset="0x1C" width="32" description="">
		<bitfield id="RESET_ISO_EDGE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="W"/> 
		<bitfield id="RESET_ISO_ACK" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="W"/> 
		<bitfield id="RESET_ISO_REQ" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W1C"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_mii_rt_reg" acronym="PR1_CFG__SLV__REGS_mii_rt_reg" offset="0x2C" width="32" description="">
		<bitfield id="MII_RT_EVENT_EN" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register>
