ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_iepclk_reg" acronym="PR1_CFG__SLV__REGS_iepclk_reg" offset="0x30" width="32" description="">
		<bitfield id="IEP1_SLV_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="IEP_OCP_CLK_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_spp_reg" acronym="PR1_CFG__SLV__REGS_spp_reg" offset="0x34" width="32" description="">
		<bitfield id="RTU_XFR_SHIFT_EN" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="XFR_BYTE_SHIFT_EN" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="XFR_SHIFT_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="PRU1_PAD_HP_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_core_sync_reg" acronym="PR1_CFG__SLV__REGS_core_sync_reg" offset="0x3C" width="32" description="">
		<bitfield id="CORE_VBUSP_SYNC_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_sa_mx_reg" acronym="PR1_CFG__SLV__REGS_sa_mx_reg" offset="0x40" width="32" description="">
		<bitfield id="PWM_EFC_EN" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/> 
		<bitfield id="PWM3_REMAP_EN" width="2" begin="11" end="10" resetval="0x0" description="" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM0_REMAP_EN" width="2" begin="9" end="8" resetval="0x0" description="" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SA_MUX_SEL" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_div_reg" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_div_reg" offset="0x44" width="32" description="">
		<bitfield id="PRU0_SD_MAN_REC_CLK_PERIOD" width="8" begin="31" end="24" resetval="0x0" description="" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PRU0_SD_MAN_CLK_CAL_DONE" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/> 
		<bitfield id="PRU0_SD_MAN_STATUS" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R"/> 
		<bitfield id="PRU0_SD_CH_SEL" width="4" begin="14" end="11" resetval="0x0" description="" range="14 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_MAN_NV_DATA_EN" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_MAN_EN" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SHARE_EN" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg0" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg0" offset="0x48" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL0" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL0" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg0" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg0" offset="0x4C" width="32" description="">
		<bitfield id="PRU0_FD_EN_0" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_0" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE0" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg1" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg1" offset="0x50" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL1" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL1" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg1" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg1" offset="0x54" width="32" description="">
		<bitfield id="PRU0_FD_EN_1" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_1" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE1" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg2" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg2" offset="0x58" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL2" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV2" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL2" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg2" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg2" offset="0x5C" width="32" description="">
		<bitfield id="PRU0_FD_EN_2" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_2" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE2" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg3" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg3" offset="0x60" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL3" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV3" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL3" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg3" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg3" offset="0x64" width="32" description="">
		<bitfield id="PRU0_FD_EN_3" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_3" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE3" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg4" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg4" offset="0x68" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL4" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV4" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL4" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg4" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg4" offset="0x6C" width="32" description="">
		<bitfield id="PRU0_FD_EN_4" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_4" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE4" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg5" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg5" offset="0x70" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL5" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV5" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL5" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg5" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg5" offset="0x74" width="32" description="">
		<bitfield id="PRU0_FD_EN_5" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_5" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE5" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg6" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg6" offset="0x78" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL6" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV6" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL6" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg6" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg6" offset="0x7C" width="32" description="">
		<bitfield id="PRU0_FD_EN_6" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_6" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE6" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
