ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg7" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg7" offset="0x80" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL7" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV7" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL7" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg7" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg7" offset="0x84" width="32" description="">
		<bitfield id="PRU0_FD_EN_7" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_7" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_7" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_7" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_7" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_7" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE7" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg8" acronym="PR1_CFG__SLV__REGS_pru0_sd_clk_sel_reg8" offset="0x88" width="32" description="">
		<bitfield id="PRU0_FD_ZERO_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ZERO_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_ACC_SEL8" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_INV8" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_CLK_SEL8" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg8" acronym="PR1_CFG__SLV__REGS_pru0_sd_sample_size_reg8" offset="0x8C" width="32" description="">
		<bitfield id="PRU0_FD_EN_8" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MAX_8" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MAX_LIMIT_8" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_ONE_MIN_8" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU0_FD_ONE_MIN_LIMIT_8" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_FD_WINDOW_SIZE_8" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU0_SD_SAMPLE_SIZE8" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_div_reg" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_div_reg" offset="0x90" width="32" description="">
		<bitfield id="PRU1_SD_MAN_REC_CLK_PERIOD" width="8" begin="31" end="24" resetval="0x0" description="" range="31 - 24" rwaccess="R"/> 
		<bitfield id="PRU1_SD_MAN_CLK_CAL_DONE" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/> 
		<bitfield id="PRU1_SD_MAN_STATUS" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R"/> 
		<bitfield id="PRU1_SD_CH_SEL" width="4" begin="14" end="11" resetval="0x0" description="" range="14 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_MAN_NV_DATA_EN" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_MAN_EN" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SHARE_EN" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg0" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg0" offset="0x94" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL0" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL0" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg0" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg0" offset="0x98" width="32" description="">
		<bitfield id="PRU1_FD_EN_0" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_0" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_0" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_0" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_0" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_0" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE0" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg1" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg1" offset="0x9C" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL1" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL1" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg1" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg1" offset="0xA0" width="32" description="">
		<bitfield id="PRU1_FD_EN_1" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_1" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_1" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_1" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_1" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE1" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg2" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg2" offset="0xA4" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL2" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV2" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL2" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg2" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg2" offset="0xA8" width="32" description="">
		<bitfield id="PRU1_FD_EN_2" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_2" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_2" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_2" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_2" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE2" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
