ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg3" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg3" offset="0xAC" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL3" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV3" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL3" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg3" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg3" offset="0xB0" width="32" description="">
		<bitfield id="PRU1_FD_EN_3" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_3" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_3" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_3" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_3" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_3" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE3" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg4" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg4" offset="0xB4" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL4" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV4" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL4" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg4" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg4" offset="0xB8" width="32" description="">
		<bitfield id="PRU1_FD_EN_4" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_4" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_4" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_4" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_4" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_4" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE4" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg5" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg5" offset="0xBC" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL5" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV5" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL5" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg5" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg5" offset="0xC0" width="32" description="">
		<bitfield id="PRU1_FD_EN_5" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_5" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_5" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_5" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_5" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_5" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE5" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg6" acronym="PR1_CFG__SLV__REGS_pru1_sd_clk_sel_reg6" offset="0xC4" width="32" description="">
		<bitfield id="PRU1_FD_ZERO_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ZERO_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_ACC_SEL6" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_INV6" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_CLK_SEL6" width="2" begin="1" end="0" resetval="0x0" description="" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg6" acronym="PR1_CFG__SLV__REGS_pru1_sd_sample_size_reg6" offset="0xC8" width="32" description="">
		<bitfield id="PRU1_FD_EN_6" width="1" begin="23" end="23" resetval="0x0" description="" range="23" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MAX_6" width="1" begin="22" end="22" resetval="0x0" description="" range="22" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MAX_LIMIT_6" width="5" begin="21" end="17" resetval="0x0" description="" range="21 - 17" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_ONE_MIN_6" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W1C"/> 
		<bitfield id="PRU1_FD_ONE_MIN_LIMIT_6" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_FD_WINDOW_SIZE_6" width="3" begin="10" end="8" resetval="0x0" description="" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="PRU1_SD_SAMPLE_SIZE6" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
