ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pru0_ed_ch0_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru0_ed_ch0_cfg1_reg" offset="0xEC" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER0" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TST_DELAY_COUNTER0" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_ed_ch1_cfg0_reg" acronym="PR1_CFG__SLV__REGS_pru0_ed_ch1_cfg0_reg" offset="0xF0" width="32" description="">
		<bitfield id="PRU0_ED_TX_FIFO_SWAP_BITS1" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_SW_CLK_OUT1" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_CLK_OUT_OVR_EN1" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_RX_SNOOP1" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/> 
		<bitfield id="PRU0_ED_RX_FRAME_SIZE1" width="12" begin="27" end="16" resetval="0x0" description="" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TX_FRAME_SIZE1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TX_WDLY1" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_ed_ch1_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru0_ed_ch1_cfg1_reg" offset="0xF4" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER1" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TST_DELAY_COUNTER1" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_ed_ch2_cfg0_reg" acronym="PR1_CFG__SLV__REGS_pru0_ed_ch2_cfg0_reg" offset="0xF8" width="32" description="">
		<bitfield id="PRU0_ED_TX_FIFO_SWAP_BITS2" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_SW_CLK_OUT2" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_CLK_OUT_OVR_EN2" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_RX_SNOOP2" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/> 
		<bitfield id="PRU0_ED_RX_FRAME_SIZE2" width="12" begin="27" end="16" resetval="0x0" description="" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TX_FRAME_SIZE2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TX_WDLY2" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru0_ed_ch2_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru0_ed_ch2_cfg1_reg" offset="0xFC" width="32" description="">
		<bitfield id="PRU0_ED_RX_EN_COUNTER2" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU0_ED_TST_DELAY_COUNTER2" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_rx_cfg_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_rx_cfg_reg" offset="0x100" width="32" description="">
		<bitfield id="PRU1_ED_RX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_SB_POL" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_SAMPLE_SIZE" width="3" begin="2" end="0" resetval="0x7" description="" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_tx_cfg_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_tx_cfg_reg" offset="0x104" width="32" description="">
		<bitfield id="PRU1_ED_TX_DIV_FACTOR" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_DIV_FACTOR_FRAC" width="1" begin="15" end="15" resetval="0x0" description="" range="15" rwaccess="R/W"/> 
		<bitfield id="PRU1_ENDAT_SHARE_EN" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/> 
		<bitfield id="PRU1_ENDAT2_CLK_SYNC" width="1" begin="10" end="10" resetval="0x1" description="" range="10" rwaccess="R"/> 
		<bitfield id="PRU1_ENDAT1_CLK_SYNC" width="1" begin="9" end="9" resetval="0x1" description="" range="9" rwaccess="R"/> 
		<bitfield id="PRU1_ENDAT0_CLK_SYNC" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R"/> 
		<bitfield id="PRU1_ED_BUSY_2" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="PRU1_ED_BUSY_1" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/> 
		<bitfield id="PRU1_ED_BUSY_0" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/> 
		<bitfield id="PRU1_ED_TX_CLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch0_cfg0_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch0_cfg0_reg" offset="0x108" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS0" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_SW_CLK_OUT0" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_CLK_OUT_OVR_EN0" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_SNOOP0" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/> 
		<bitfield id="PRU1_ED_RX_FRAME_SIZE0" width="12" begin="27" end="16" resetval="0x0" description="" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_FRAME_SIZE0" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_WDLY0" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch0_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch0_cfg1_reg" offset="0x10C" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER0" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TST_DELAY_COUNTER0" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch1_cfg0_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch1_cfg0_reg" offset="0x110" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS1" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_SW_CLK_OUT1" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_CLK_OUT_OVR_EN1" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_SNOOP1" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/> 
		<bitfield id="PRU1_ED_RX_FRAME_SIZE1" width="12" begin="27" end="16" resetval="0x0" description="" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_FRAME_SIZE1" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_WDLY1" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R/W"/>
	</register>
