ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch1_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch1_cfg1_reg" offset="0x114" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER1" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TST_DELAY_COUNTER1" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch2_cfg0_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch2_cfg0_reg" offset="0x118" width="32" description="">
		<bitfield id="PRU1_ED_TX_FIFO_SWAP_BITS2" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_SW_CLK_OUT2" width="1" begin="30" end="30" resetval="0x0" description="" range="30" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_CLK_OUT_OVR_EN2" width="1" begin="29" end="29" resetval="0x0" description="" range="29" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_RX_SNOOP2" width="1" begin="28" end="28" resetval="0x0" description="" range="28" rwaccess="R"/> 
		<bitfield id="PRU1_ED_RX_FRAME_SIZE2" width="12" begin="27" end="16" resetval="0x0" description="" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_FRAME_SIZE2" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TX_WDLY2" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pru1_ed_ch2_cfg1_reg" acronym="PR1_CFG__SLV__REGS_pru1_ed_ch2_cfg1_reg" offset="0x11C" width="32" description="">
		<bitfield id="PRU1_ED_RX_EN_COUNTER2" width="16" begin="31" end="16" resetval="0x0" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="PRU1_ED_TST_DELAY_COUNTER2" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_rtu0_poke_en0_reg" acronym="PR1_CFG__SLV__REGS_rtu0_poke_en0_reg" offset="0x124" width="32" description="">
		<bitfield id="RTU0_POKE_R27_EN" width="4" begin="31" end="28" resetval="0x0" description="" range="31 - 28" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R26_EN" width="4" begin="27" end="24" resetval="0x0" description="" range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R25_EN" width="4" begin="23" end="20" resetval="0x0" description="" range="23 - 20" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R24_EN" width="4" begin="19" end="16" resetval="0x0" description="" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R23_EN" width="4" begin="15" end="12" resetval="0x0" description="" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R22_EN" width="4" begin="11" end="8" resetval="0x0" description="" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R21_EN" width="4" begin="7" end="4" resetval="0x0" description="" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="RTU0_POKE_R20_EN" width="4" begin="3" end="0" resetval="0x0" description="" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_rtu1_poke_en0_reg" acronym="PR1_CFG__SLV__REGS_rtu1_poke_en0_reg" offset="0x12C" width="32" description="">
		<bitfield id="RTU1_POKE_R27_EN" width="4" begin="31" end="28" resetval="0x0" description="" range="31 - 28" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R26_EN" width="4" begin="27" end="24" resetval="0x0" description="" range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R25_EN" width="4" begin="23" end="20" resetval="0x0" description="" range="23 - 20" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R24_EN" width="4" begin="19" end="16" resetval="0x0" description="" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R23_EN" width="4" begin="15" end="12" resetval="0x0" description="" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R22_EN" width="4" begin="11" end="8" resetval="0x0" description="" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R21_EN" width="4" begin="7" end="4" resetval="0x0" description="" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="RTU1_POKE_R20_EN" width="4" begin="3" end="0" resetval="0x0" description="" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm0" acronym="PR1_CFG__SLV__REGS_pwm0" offset="0x130" width="32" description="">
		<bitfield id="PWM0_TRIP_S" width="1" begin="30" end="30" resetval="0x0" description="Safety trip status" range="30" rwaccess="R/W1C"/> 
		<bitfield id="PWM0_TRIP_VEC" width="9" begin="29" end="21" resetval="0x0" description="Safety trip trigger cause vector" range="29 - 21" rwaccess="R"/> 
		<bitfield id="PWM0_POS_ERR_TRIP" width="1" begin="20" end="20" resetval="0x0" description="SW position saftey error trip" range="20" rwaccess="R/W"/> 
		<bitfield id="PWM0_OVER_ERR_TRIP" width="1" begin="19" end="19" resetval="0x0" description="SW over safety error trip" range="19" rwaccess="R/W"/> 
		<bitfield id="PWM0_TRIP_RESET" width="1" begin="18" end="18" resetval="0x0" description="SW reset safety flag" range="18" rwaccess="R/W"/> 
		<bitfield id="PWM0_TRIP_CMP0_EN" width="1" begin="17" end="17" resetval="0x0" description="CMP0 reset safety trip clear enable" range="17" rwaccess="R/W"/> 
		<bitfield id="PWM0_TRIP_MASK" width="9" begin="16" end="8" resetval="0x0" description="SW mask for safety trip, one hot" range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM0_DEBOUNCE_VALUE" width="8" begin="7" end="0" resetval="0x0" description="debounce counter , defines the number of core_clk required for the pulse not to get rejected " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm1" acronym="PR1_CFG__SLV__REGS_pwm1" offset="0x134" width="32" description="">
		<bitfield id="PWM1_TRIP_S" width="1" begin="30" end="30" resetval="0x0" description="Safety trip status" range="30" rwaccess="R/W1C"/> 
		<bitfield id="PWM1_TRIP_VEC" width="9" begin="29" end="21" resetval="0x0" description="Safety trip trigger cause vector" range="29 - 21" rwaccess="R"/> 
		<bitfield id="PWM1_POS_ERR_TRIP" width="1" begin="20" end="20" resetval="0x0" description="SW position saftey error trip" range="20" rwaccess="R/W"/> 
		<bitfield id="PWM1_OVER_ERR_TRIP" width="1" begin="19" end="19" resetval="0x0" description="SW over safety error trip" range="19" rwaccess="R/W"/> 
		<bitfield id="PWM1_TRIP_RESET" width="1" begin="18" end="18" resetval="0x0" description="SW reset safety flag" range="18" rwaccess="R/W"/> 
		<bitfield id="PWM1_TRIP_CMP0_EN" width="1" begin="17" end="17" resetval="0x0" description="CMP0 reset safety trip clear enable" range="17" rwaccess="R/W"/> 
		<bitfield id="PWM1_TRIP_MASK" width="9" begin="16" end="8" resetval="0x0" description="SW mask for safety trip, one hot" range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM1_DEBOUNCE_VALUE" width="8" begin="7" end="0" resetval="0x0" description="debounce counter , defines the number of core_clk required for the pulse not to get rejected " range="7 - 0" rwaccess="R/W"/>
	</register>
