ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pwm2" acronym="PR1_CFG__SLV__REGS_pwm2" offset="0x138" width="32" description="">
		<bitfield id="PWM2_TRIP_S" width="1" begin="30" end="30" resetval="0x0" description="Safety trip status" range="30" rwaccess="R/W1C"/> 
		<bitfield id="PWM2_TRIP_VEC" width="9" begin="29" end="21" resetval="0x0" description="Safety trip trigger cause vector" range="29 - 21" rwaccess="R"/> 
		<bitfield id="PWM2_POS_ERR_TRIP" width="1" begin="20" end="20" resetval="0x0" description="SW position saftey error trip" range="20" rwaccess="R/W"/> 
		<bitfield id="PWM2_OVER_ERR_TRIP" width="1" begin="19" end="19" resetval="0x0" description="SW over safety error trip" range="19" rwaccess="R/W"/> 
		<bitfield id="PWM2_TRIP_RESET" width="1" begin="18" end="18" resetval="0x0" description="SW reset safety flag" range="18" rwaccess="R/W"/> 
		<bitfield id="PWM2_TRIP_CMP0_EN" width="1" begin="17" end="17" resetval="0x0" description="CMP0 reset safety trip clear enable" range="17" rwaccess="R/W"/> 
		<bitfield id="PWM2_TRIP_MASK" width="9" begin="16" end="8" resetval="0x0" description="SW mask for safety trip, one hot" range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM2_DEBOUNCE_VALUE" width="8" begin="7" end="0" resetval="0x0" description="debounce counter , defines the number of core_clk required for the pulse not to get rejected " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm3" acronym="PR1_CFG__SLV__REGS_pwm3" offset="0x13C" width="32" description="">
		<bitfield id="PWM3_TRIP_S" width="1" begin="30" end="30" resetval="0x0" description="Safety trip status" range="30" rwaccess="R/W1C"/> 
		<bitfield id="PWM3_TRIP_VEC" width="9" begin="29" end="21" resetval="0x0" description="Safety trip trigger cause vector" range="29 - 21" rwaccess="R"/> 
		<bitfield id="PWM3_POS_ERR_TRIP" width="1" begin="20" end="20" resetval="0x0" description="SW position saftey error trip" range="20" rwaccess="R/W"/> 
		<bitfield id="PWM3_OVER_ERR_TRIP" width="1" begin="19" end="19" resetval="0x0" description="SW over safety error trip" range="19" rwaccess="R/W"/> 
		<bitfield id="PWM3_TRIP_RESET" width="1" begin="18" end="18" resetval="0x0" description="SW reset safety flag" range="18" rwaccess="R/W"/> 
		<bitfield id="PWM3_TRIP_CMP0_EN" width="1" begin="17" end="17" resetval="0x0" description="CMP0 reset safety trip clear enable" range="17" rwaccess="R/W"/> 
		<bitfield id="PWM3_TRIP_MASK" width="9" begin="16" end="8" resetval="0x0" description="SW mask for safety trip, one hot" range="16 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM3_DEBOUNCE_VALUE" width="8" begin="7" end="0" resetval="0x0" description="debounce counter , defines the number of core_clk required for the pulse not to get rejected " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm0_0" acronym="PR1_CFG__SLV__REGS_pwm0_0" offset="0x140" width="32" description="">
		<bitfield id="PWM0_0_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM0_0_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM0_0_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM0_0_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM0_0_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM0_0_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm0_1" acronym="PR1_CFG__SLV__REGS_pwm0_1" offset="0x144" width="32" description="">
		<bitfield id="PWM0_1_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM0_1_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM0_1_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM0_1_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM0_1_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM0_1_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm0_2" acronym="PR1_CFG__SLV__REGS_pwm0_2" offset="0x148" width="32" description="">
		<bitfield id="PWM0_2_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM0_2_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM0_2_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM0_2_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM0_2_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM0_2_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm1_0" acronym="PR1_CFG__SLV__REGS_pwm1_0" offset="0x14C" width="32" description="">
		<bitfield id="PWM1_0_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM1_0_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM1_0_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM1_0_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM1_0_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM1_0_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
