ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_pwm1_1" acronym="PR1_CFG__SLV__REGS_pwm1_1" offset="0x150" width="32" description="">
		<bitfield id="PWM1_1_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM1_1_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM1_1_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM1_1_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM1_1_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM1_1_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm1_2" acronym="PR1_CFG__SLV__REGS_pwm1_2" offset="0x154" width="32" description="">
		<bitfield id="PWM1_2_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM1_2_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM1_2_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM1_2_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM1_2_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM1_2_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm2_0" acronym="PR1_CFG__SLV__REGS_pwm2_0" offset="0x158" width="32" description="">
		<bitfield id="PWM2_0_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM2_0_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM2_0_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM2_0_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM2_0_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM2_0_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm2_1" acronym="PR1_CFG__SLV__REGS_pwm2_1" offset="0x15C" width="32" description="">
		<bitfield id="PWM2_1_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM2_1_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM2_1_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM2_1_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM2_1_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM2_1_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm2_2" acronym="PR1_CFG__SLV__REGS_pwm2_2" offset="0x160" width="32" description="">
		<bitfield id="PWM2_2_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM2_2_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM2_2_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM2_2_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM2_2_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM2_2_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm3_0" acronym="PR1_CFG__SLV__REGS_pwm3_0" offset="0x164" width="32" description="">
		<bitfield id="PWM3_0_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM3_0_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM3_0_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM3_0_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM3_0_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM3_0_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm3_1" acronym="PR1_CFG__SLV__REGS_pwm3_1" offset="0x168" width="32" description="">
		<bitfield id="PWM3_1_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM3_1_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM3_1_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM3_1_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM3_1_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM3_1_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pwm3_2" acronym="PR1_CFG__SLV__REGS_pwm3_2" offset="0x16C" width="32" description="">
		<bitfield id="PWM3_2_NEG_ACT" width="2" begin="11" end="10" resetval="0x0" description="Active neg state 00 toggle 01 L 10 H" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="PWM3_2_POS_ACT" width="2" begin="9" end="8" resetval="0x0" description="Active pos state 00 toggle 01 L 10 H" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="PWM3_2_NEG_TRIP" width="2" begin="7" end="6" resetval="0x0" description="Safety Trip neg state 00 z 01 L 10 H" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="PWM3_2_POS_TRIP" width="2" begin="5" end="4" resetval="0x0" description="Safety Trip pos state 00 z 01 L 10 H" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PWM3_2_NEG_INIT" width="2" begin="3" end="2" resetval="0x0" description="Initial neg state 00 z 01 L 10 H" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="PWM3_2_POS_INIT" width="2" begin="1" end="0" resetval="0x0" description="Initial pos state 00 z 01 L 10 H" range="1 - 0" rwaccess="R/W"/>
	</register>
