ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PRU_ICSSG0_PR1_CFG_SLV.xml
	<register id="PR1_CFG__SLV__REGS_spin_lock0" acronym="PR1_CFG__SLV__REGS_spin_lock0" offset="0x170" width="32" description="">
		<bitfield id="MMR_OWN_REQ_VECTOR_0" width="6" begin="13" end="8" resetval="0x0" description="Spin Lock flag Vector " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="MMR_OWN_REQ_CLR_0" width="1" begin="1" end="1" resetval="0x0" description="Spin Lock Status Clear" range="1" rwaccess="W1C"/> 
		<bitfield id="MMR_OWN_REQ_STATUS_0" width="1" begin="0" end="0" resetval="0x0" description="Spin Lock Status" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_spin_lock1" acronym="PR1_CFG__SLV__REGS_spin_lock1" offset="0x174" width="32" description="">
		<bitfield id="MMR_OWN_REQ_VECTOR_1" width="6" begin="13" end="8" resetval="0x0" description="Spin Lock flag Vector " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="MMR_OWN_REQ_CLR_1" width="1" begin="1" end="1" resetval="0x0" description="Spin Lock Status Clear" range="1" rwaccess="W1C"/> 
		<bitfield id="MMR_OWN_REQ_STATUS_1" width="1" begin="0" end="0" resetval="0x0" description="Spin Lock Status" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg0" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg0" offset="0x178" width="32" description="">
		<bitfield id="PA_PDSP0_INC_TYPE" width="1" begin="31" end="31" resetval="0x0" description="pa_pdsp0_inc_type" range="31" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP0_INC_VAL" width="17" begin="30" end="14" resetval="0x0" description="pa_pdsp0_inc_val" range="30 - 14" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP0_INDEX" width="14" begin="13" end="0" resetval="0x0" description="pa_pdsp0_index" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat0" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat0" offset="0x17C" width="32" description="">
		<bitfield id="PA_PDSP0_STATUS" width="3" begin="3" end="1" resetval="0x0" description="pa_pdsp0_status" range="3 - 1" rwaccess="R"/> 
		<bitfield id="PA_PDSP0_READY" width="1" begin="0" end="0" resetval="0x0" description="pa_pdsp0_ready" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg1" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg1" offset="0x180" width="32" description="">
		<bitfield id="PA_PDSP1_INC_TYPE" width="1" begin="31" end="31" resetval="0x0" description="pa_pdsp1_inc_type" range="31" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP1_INC_VAL" width="17" begin="30" end="14" resetval="0x0" description="pa_pdsp1_inc_val" range="30 - 14" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP1_INDEX" width="14" begin="13" end="0" resetval="0x0" description="pa_pdsp1_index" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat1" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat1" offset="0x184" width="32" description="">
		<bitfield id="PA_PDSP1_STATUS" width="3" begin="3" end="1" resetval="0x0" description="pa_pdsp1_status" range="3 - 1" rwaccess="R"/> 
		<bitfield id="PA_PDSP1_READY" width="1" begin="0" end="0" resetval="0x0" description="pa_pdsp1_ready" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg2" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg2" offset="0x188" width="32" description="">
		<bitfield id="PA_PDSP2_INC_TYPE" width="1" begin="31" end="31" resetval="0x0" description="pa_pdsp2_inc_type" range="31" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP2_INC_VAL" width="17" begin="30" end="14" resetval="0x0" description="pa_pdsp2_inc_val" range="30 - 14" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP2_INDEX" width="14" begin="13" end="0" resetval="0x0" description="pa_pdsp2_index" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat2" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat2" offset="0x18C" width="32" description="">
		<bitfield id="PA_PDSP2_STATUS" width="3" begin="3" end="1" resetval="0x0" description="pa_pdsp2_status" range="3 - 1" rwaccess="R"/> 
		<bitfield id="PA_PDSP2_READY" width="1" begin="0" end="0" resetval="0x0" description="pa_pdsp2_ready" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg3" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_cfg3" offset="0x190" width="32" description="">
		<bitfield id="PA_PDSP3_INC_TYPE" width="1" begin="31" end="31" resetval="0x0" description="pa_pdsp3_inc_type" range="31" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP3_INC_VAL" width="17" begin="30" end="14" resetval="0x0" description="pa_pdsp3_inc_val" range="30 - 14" rwaccess="R/W"/> 
		<bitfield id="PA_PDSP3_INDEX" width="14" begin="13" end="0" resetval="0x0" description="pa_pdsp3_index" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat3" acronym="PR1_CFG__SLV__REGS_pa_stat_pdsp_stat3" offset="0x194" width="32" description="">
		<bitfield id="PA_PDSP3_STATUS" width="3" begin="3" end="1" resetval="0x0" description="pa_pdsp3_status" range="3 - 1" rwaccess="R"/> 
		<bitfield id="PA_PDSP3_READY" width="1" begin="0" end="0" resetval="0x0" description="pa_pdsp3_ready" range="0" rwaccess="R"/>
	</register>
</module>